# CustomFieldData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomFieldData Members
CustomFieldData Class Methods Properties See Also
---
The CustomFieldData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the CustomFieldData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCustomFieldId | Gets an unique identifier of the custom field. |
| GetCustomFieldProperties | Gets an instance of ICustomFieldProperties which represents the properties of this field. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetCustomFieldProperties | Sets an instance of ICustomFieldProperties which represents the properties of this field. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| ValidateCustomFieldProperties | Validates the custom field properties. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultRowHeightOnSheet | Identifies the default row height for this field. |
| FieldName | The name of this custom field. |
| FieldTooltip | The tooltip that will be shown in the schedule properties dialog for this custom field. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace